# Categorial Encoding : Label Encoding & One Hot Encoding
Categorial Encoding adalah proses konversi categorial menjadi nilai numerical. Terdapat banyak jenis Categorial Encosing, dua diantaranya adalah
- Label Encoding(Pada Label Encoding setiap kategory pada suatu feature akan diurutkan secara alfabet dan direpresentasikan dengan sebuah nilai integer)
search from wikipedia

In [2]:
import pandas as pd 
df = pd.DataFrame({'country': ['India','US','Japan','US','Japan'],
                    'age': [44,34,46,35,23],
                    'salary': [72000, 65000,98000,45000,34000]})
df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [3]:
# Label Encoding Pada Scikit Learn
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [5]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

Kelemahan pada label encoding terletak pada saat indexing yang memungkinkan nilai index masuk perhitungan yang akan membingungkan machine learning, oleh karena itu maka akan melihat metode yang lain yaitu one hot encoding

- One Hot Encoding(pada One Hot Encoding, setiap kategori pada suatu feature akan di urutkan secara alfabet dab direpresentasikan sebagai sekumpulan bits)

In [6]:
import pandas as pd 
df = pd.DataFrame({'country': ['India','US','Japan','US','Japan'],
                    'age': [44,34,46,35,23],
                    'salary': [72000, 65000,98000,45000,34000]})
df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [7]:
# One Hot Encoding pada Scikit Learn
X = df['country'].values.reshape(-1,1)
X

array([['India'],
       ['US'],
       ['Japan'],
       ['US'],
       ['Japan']], dtype=object)

In [9]:
from sklearn.preprocessing import OneHotEncoder
onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray() 
X

array([[0., 1., 1., 0., 1., 0.],
       [1., 0., 1., 0., 0., 1.],
       [1., 0., 0., 1., 1., 0.],
       [1., 0., 1., 0., 0., 1.],
       [1., 0., 0., 1., 1., 0.]])

In [10]:
onehot_encoder.categories_

[array([0., 1.]), array([0., 1.]), array([0., 1.])]

In [11]:
df_onehot = pd.DataFrame(X, columns=[str(i) for i in range (X.shape[1])])
df_onehot

     0    1    2    3    4    5
0  0.0  1.0  1.0  0.0  1.0  0.0
1  1.0  0.0  1.0  0.0  0.0  1.0
2  1.0  0.0  0.0  1.0  1.0  0.0
3  1.0  0.0  1.0  0.0  0.0  1.0
4  1.0  0.0  0.0  1.0  1.0  0.0

In [12]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2    3    4    5 country  age  salary
0  0.0  1.0  1.0  0.0  1.0  0.0   India   44   72000
1  1.0  0.0  1.0  0.0  0.0  1.0      US   34   65000
2  1.0  0.0  0.0  1.0  1.0  0.0   Japan   46   98000
3  1.0  0.0  1.0  0.0  0.0  1.0      US   35   45000
4  1.0  0.0  0.0  1.0  1.0  0.0   Japan   23   34000

In [13]:
df = df.drop(['country'], axis=1)
df

     0    1    2    3    4    5  age  salary
0  0.0  1.0  1.0  0.0  1.0  0.0   44   72000
1  1.0  0.0  1.0  0.0  0.0  1.0   34   65000
2  1.0  0.0  0.0  1.0  1.0  0.0   46   98000
3  1.0  0.0  1.0  0.0  0.0  1.0   35   45000
4  1.0  0.0  0.0  1.0  1.0  0.0   23   34000

# Label Encoding vs One Hot Encoding
Penerapan One Hot Encoding bila:
- Nilai categorial adalah Nominal
- Jumlah kategori yang ada tidak terlalu banyak

Penerapan Label Encoding
- Nilai Categorial adalah ordinal
- Jumlah Kategori yang ada relatif banyak